app/views/users/index.html.erb

<h1><%= pluralize(@users.count, "User") %></h2>
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"