app/controllers/favorites_controller.rb

	def create
		@movie.favorites.create!(user: current_user)
---
INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-24 15:03:13.265211"], ["movie_id", 1], ["updated_at", "2014-11-24 15:03:13.265211"], ["user_id", 9]]

	def destroy
		favorite = current_user.favorites.find(params[:id])
		favorite.destroy
---
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 9], ["id", 25]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 25]]