app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "I laughed, I cried, I spilled my popcorn!"], ["created_at", "2014-11-23 21:10:02.247742"], ["movie_id", 1], ["stars", 3], ["updated_at", "2014-11-23 21:10:02.247742"], ["user_id", 1]]