app/controllers/reviews_controller.rb

  def set_review
    @review = @movie.reviews.find(params[:id])
---
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]