app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

	def update
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "users" SET "email" = ?, "name" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["email", "joe.doe@doe.org"], ["name", "Joe Doe"], ["updated_at", "2014-11-22 13:45:02.664420"]]